const cvs = document.getElementById('cvs');
const ctx = cvs.getContext('2d');

cvs.width = window.innerWidth;
cvs.height = window.innerHeight;

 /*

создать функцию, которая получает массив из объектов
со свойствамии x и y
и рисует ломаную по указанным координатам

*/

function drawLine(coords) {

    ctx.beginPath();
    ctx.moveTo(coords[0].x, coords[0].y);
  
    for (let i = 0; i < coords.length; i++) {
      ctx.lineTo(coords[i].x, coords[i].y);
    }
  
    //ctx.fill(); // заливка
    ctx.stroke(); //линия
  }

  const coords = [
    { x: 50, y: 100 },
    { x: 50, y: 50 },
    { x: 100, y: 10 },
    { x: 150, y: 50 },
    { x: 150, y: 100 },
    { x: 100, y: 100 },
  ];
  
  drawLine(coords);


/*

beginPath()

Метод начинает новый путь рисования, сбрасывая все предыдущие команды рисования. Это позволяет создавать отдельные пути, которые могут быть стилизованы отдельно друг от друга.

moveTo(x, y)

перемещает "курсор" в позицию x, y и делает её текущей
Метод устанавливает начальную точку пути для рисования. Для метода lineTo это означает, что следующая точка начинает рисоваться с позиции, заданной moveTo.

lineTo(x, y)

ведёт линию из текущей позиции в указанную, и делает в последствии указанную текущей. Короч чтобы нарисовать линию до следующей точки

*/